chenwangqing/Coroutine/Keil/HC32F103/LIB/HC32F10x_StdPeriph_Driver/inc/hc32f10x_can.h
  uint8_t RTR;     /*!< Specifies the type of frame for the received message.
                        This parameter can be a value of 
                        @ref CAN_remote_transmission_request */

  uint8_t DLC;     /*!< Specifies the length of the frame that will be received.
                        This parameter can be a value between 0 to 8 */

  uint8_t Data[8]; /*!< Contains the data to be received. It ranges from 0 to 
                        0xFF. */

  uint8_t FMI;     /*!< Specifies the index of the filter the message stored in 
                        the mailbox passes through. This parameter can be a 
                        value between 0 to 0xFF */
} CanRxMsg;


/*************************************************************************
Register Address 
*************************************************************************/
#define CAN1													0x40006400
#define CAN2													0x40006800

#define CAN1_FiR1_BASE								0x40006640
#define CAN1_FiR2_BASE								0x40006644

#define CAN_TIR_OFFSET_BASE 					0x180
#define CAN_TDTR_OFFSET_BASE 					0x184
#define CAN_TDLR_OFFSET_BASE 					0x188
#define CAN_TDHR_OFFSET_BASE 					0x18C

#define CAN_RIR_OFFSET_BASE 					0x1B0
#define CAN_RDTR_OFFSET_BASE 					0x1B4
#define CAN_RDLR_OFFSET_BASE 					0x1B8
#define CAN_RDHR_OFFSET_BASE 					0x1BC

#define CAN_MCR(CANn)									(*(volatile uint32_t *)(uint32_t)(CANn + 0x00))
#define CAN_MSR(CANn)									(*(volatile uint32_t *)(uint32_t)(CANn + 0x04))
#define CAN_TSR(CANn)									(*(volatile uint32_t *)(uint32_t)(CANn + 0x08))
#define CAN_RF0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x0C))
#define CAN_RF1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x10))
#define CAN_IER(CANn)									(*(volatile uint32_t *)(uint32_t)(CANn + 0x14))
#define CAN_ESR(CANn)									(*(volatile uint32_t *)(uint32_t)(CANn + 0x18))
#define CAN_BTR(CANn)									(*(volatile uint32_t *)(uint32_t)(CANn + 0x1C))

#define CAN_TI0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x180))
#define CAN_TI1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x190))
#define CAN_TI2R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1A0))
#define CAN_TDT0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x184))
#define CAN_TDT1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x194))
#define CAN_TDT2R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1A4))
#define CAN_TDL0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x188))
#define CAN_TDL1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x198))
#define CAN_TDL2R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1A8))
#define CAN_TDH0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x18C))
#define CAN_TDH1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x19C))
#define CAN_TDH2R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1AC))

#define CAN_RI0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1B0))
#define CAN_RI1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1C0))
#define CAN_RDT0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1B4))
#define CAN_RDT1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1C4))
#define CAN_RDL0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1B8))
#define CAN_RDL1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1C8))
#define CAN_RDH0R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1BC))
#define CAN_RDH1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x1CC))

#define CAN_FMR(CANn)									(*(volatile uint32_t *)(uint32_t)(CANn + 0x200))
#define CAN_FM1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x204))
#define CAN_FS1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x20C))
#define CAN_FFA1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x214))
#define CAN_FA1R(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x21C))
#define CAN_F0R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x240))
#define CAN_F0R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x244))
#define CAN_F1R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x248))
#define CAN_F1R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x24C))
#define CAN_F2R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x250))
#define CAN_F2R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x254))
#define CAN_F3R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x258))
#define CAN_F3R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x25C))
#define CAN_F4R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x260))
#define CAN_F4R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x264))
#define CAN_F5R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x268))
#define CAN_F5R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x26C))
#define CAN_F6R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x270))
#define CAN_F6R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x274))
#define CAN_F7R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x278))
#define CAN_F7R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x27C))
#define CAN_F8R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x280))
#define CAN_F8R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x284))
#define CAN_F9R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x288))
#define CAN_F9R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x28C))
#define CAN_F10R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x290))
#define CAN_F10R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x294))
#define CAN_F11R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x298))
#define CAN_F11R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x29C))
#define CAN_F12R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x2A0))
#define CAN_F12R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x2A4))
#define CAN_F13R1(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x2A8))
#define CAN_F13R2(CANn)								(*(volatile uint32_t *)(uint32_t)(CANn + 0x2AC))

