chenwangqing/Coroutine/Keil/HC32F103/LIB/HC32F10x_StdPeriph_Driver/inc/hc32f10x_can.h
/* Initialization and Configuration functions *********************************/ 
uint8_t CAN_Init(uint32_t CANx, CAN_InitTypeDef* CAN_InitStruct);
void CAN_FilterInit(CAN_FilterInitTypeDef* CAN_FilterInitStruct);
void CAN_StructInit(CAN_InitTypeDef* CAN_InitStruct);
void CAN_SlaveStartBank(uint8_t CAN_BankNumber); 
void CAN_DBGFreeze(uint32_t CANx, FunctionalState NewState);
void CAN_TTComModeCmd(uint32_t CANx, FunctionalState NewState);

/* Transmit functions *********************************************************/
uint8_t CAN_Transmit(uint32_t CANx, CanTxMsg* TxMessage);
uint8_t CAN_TransmitStatus(uint32_t CANx, uint8_t TransmitMailbox);
void CAN_CancelTransmit(uint32_t CANx, uint8_t Mailbox);

/* Receive functions **********************************************************/
void CAN_Receive(uint32_t CANx, uint8_t FIFONumber, CanRxMsg* RxMessage);
void CAN_FIFORelease(uint32_t CANx, uint8_t FIFONumber);
uint8_t CAN_MessagePending(uint32_t CANx, uint8_t FIFONumber);


/* Operation modes functions **************************************************/
uint8_t CAN_OperatingModeRequest(uint32_t CANx, uint8_t CAN_OperatingMode);
uint8_t CAN_Sleep(uint32_t CANx);
uint8_t CAN_WakeUp(uint32_t CANx);

/* Error management functions *************************************************/
uint8_t CAN_GetLastErrorCode(uint32_t CANx);
uint8_t CAN_GetReceiveErrorCounter(uint32_t CANx);
uint8_t CAN_GetLSBTransmitErrorCounter(uint32_t CANx);

/* Interrupts and flags management functions **********************************/
void CAN_ITConfig(uint32_t CANx, uint32_t CAN_IT, FunctionalState NewState);
FlagStatus CAN_GetFlagStatus(uint32_t CANx, uint32_t CAN_FLAG);
void CAN_ClearFlag(uint32_t CANx, uint32_t CAN_FLAG);
ITStatus CAN_GetITStatus(uint32_t CANx, uint32_t CAN_IT);
void CAN_ClearITPendingBit(uint32_t CANx, uint32_t CAN_IT);

#ifdef __cplusplus
}
#endif

#endif 

/****END OF FILE****/
